use colored::*; // Підключення бібліотеки colored для кольорового тексту у консолі

// Функція для відображення заголовку програми
pub fn title_text(){
    // ASCII-арт заголовку з кольором bright_blue
    println!("{}", r#"          _____                    _____                    _____          "#.bright_blue());
    println!("{}", r#"         /\    \                  /\    \                  /\    \         "#.bright_blue());
    println!("{}", r#"        /::\    \                /::\    \                /::\    \        "#.bright_blue());
    println!("{}", r#"       /::::\    \              /::::\    \              /::::\    \       "#.bright_blue());
    println!("{}", r#"      /::::::\    \            /::::::\    \            /::::::\    \      "#.bright_blue());
    println!("{}", r#"     /:::/\:::\    \          /:::/\:::\    \          /:::/\:::\    \     "#.bright_blue());
    println!("{}", r#"    /:::/  \:::\    \        /:::/__\:::\    \        /:::/__\:::\    \    "#.bright_blue());
    println!("{}", r#"   /:::/    \:::\    \      /::::\   \:::\    \       \:::\   \:::\    \   "#.bright_blue());
    println!("{}", r#"  /:::/    / \:::\    \    /::::::\   \:::\    \    ___\:::\   \:::\    \  "#.bright_blue());
    println!("{}", r#" /:::/    /   \:::\ ___\  /:::/\:::\   \:::\    \  /\   \:::\   \:::\    \ "#.bright_blue());
    println!("{}", r#"/:::/____/     \:::|    |/:::/__\:::\   \:::\____\/::\   \:::\   \:::\____\"#.bright_blue());
    println!("{}", r#"\:::\    \     /:::|____|\:::\   \:::\   \::/    /\:::\   \:::\   \::/    /"#.bright_blue());
    println!("{}", r#" \:::\    \   /:::/    /  \:::\   \:::\   \/____/  \:::\   \:::\   \/____/ "#.bright_blue());
    println!("{}", r#"  \:::\    \ /:::/    /    \:::\   \:::\    \       \:::\   \:::\    \     "#.bright_blue());
    println!("{}", r#"   \:::\    /:::/    /      \:::\   \:::\____\       \:::\   \:::\____\    "#.bright_blue());
    println!("{}", r#"    \:::\  /:::/    /        \:::\   \::/    /        \:::\  /:::/    /    "#.bright_blue());
    println!("{}", r#"     \:::\/:::/    /          \:::\   \/____/          \:::\/:::/    /     "#.bright_blue());
    println!("{}", r#"      \::::::/    /            \:::\    \               \::::::/    /      "#.bright_blue());
    println!("{}", r#"       \::::/    /              \:::\____\               \::::/    /       "#.bright_blue());
    println!("{}", r#"        \::/____/                \::/    /                \::/    /        "#.bright_blue());
    println!("{}", r#"         ~~                       \/____/                  \/____/         "#.bright_blue());
    println!("{}", "━━━━━━━━━━━━━━━━━━━━━".bright_blue());

    // Відображення інформації про автора та групу
    println!("┃   {} {}    ┃", "Кирил".bright_blue(), "Сердюк".bright_blue());
    println!("┃      {}      ┃", "КН-2301".bright_green());
    println!("{}", "━━━━━━━━━━━━━━━━━━━━━".bright_blue());
}

// Функція для відображення головного меню користувача
pub fn help_menu(){
    println!("┏━━━━━━━━━━━━━━━━━━━━━━┓");
    println!("┃ {}    ┃", "1. 🚀 Шифрування ".green());      // Пункт меню: шифрування
    println!("┃ {} ┃", "2. 🔓 Розшифрування ".yellow());   // Пункт меню: дешифрування
    println!("┃ {}      ┃", "3. 🛈  Допомога ".cyan());      // Пункт меню: довідка/поміч
    println!("┃ {}         ┃", "4. 🚪 Вихід ".red());        // Пункт меню: вихід з програми
    println!("┗━━━━━━━━━━━━━━━━━━━━━━┛");
}
