// Функція для XOR двох 32-бітних блоків (4 байти)
// Використовується у Feistel-раунді DES
pub fn xor_32bit(a: [u8; 4], b: [u8; 4]) -> [u8; 4] {
    [
        a[0] ^ b[0], // XOR першого байта
        a[1] ^ b[1], // XOR другого байта
        a[2] ^ b[2], // XOR третього байта
        a[3] ^ b[3], // XOR четвертого байта
    ]
}

// Функція для XOR двох 48-бітних блоків (6 байт)
// Використовується для суміщення розширеного правого блоку з раундовим ключем
pub fn xor_48bit(a: [u8; 6], b: [u8; 6]) -> [u8; 6] {
    [
        a[0] ^ b[0], // XOR першого байта
        a[1] ^ b[1], // XOR другого байта
        a[2] ^ b[2], // XOR третього байта
        a[3] ^ b[3], // XOR четвертого байта
        a[4] ^ b[4], // XOR п’ятого байта
        a[5] ^ b[5], // XOR шостого байта
    ]
}
