use std::io::{self, Write};
use colored::*;

pub fn help_text() {
    println!("┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓");
    println!("┃                  🛈 Допомога                    ┃");
    println!("┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛");
    println!();
    println!("{}", "Ця програма дозволяє шифрувати та розшифровувати текст за допомогою DES.".cyan());
    println!();
    println!("{}", "Як користуватися:".green());
    println!("1. Оберіть пункт меню 1 для шифрування тексту.");
    println!("   - Введіть текст, який хочете зашифрувати (підтримується тільки латиниця).");
    println!("   - Введіть ключ довжиною 8 символів.");
    println!("   - Програма виведе зашифрований текст у HEX-форматі.");
    println!();
    println!("2. Оберіть пункт меню 2 для розшифрування тексту.");
    println!("   - Введіть HEX-код зашифрованого тексту.");
    println!("   - Введіть той самий ключ, який використовувався при шифруванні.");
    println!("   - Програма виведе розшифрований текст.");
    println!();
    println!("3. Оберіть пункт меню 3, щоб переглянути цю довідку.");
    println!("4. Оберіть пункт меню 4, щоб вийти з програми.");
    println!();
    println!("{}", "Поради:".yellow());
    println!(" - Ключ повинен бути рівно 8 символів.");
    println!(" - HEX-текст вводьте без пробілів і додаткових символів.");
    println!(" - Під час шифрування та розшифрування програма автоматично обробляє текст і HEX.");
    println!(" - Програма працює тільки з латиницею (A-Z, a-z).");
    println!();
    println!("{}", "Програму було створено Кирилом Сердюком з групи КН-2301 на мові програмування Rust".magenta());
    println!();


    let mut input = String::new();
    std::io::stdin().read_line(&mut input).unwrap();

    println!("{}", "Натисніть Enter, щоб продовжити...".bright_blue());
    let mut input = String::new();
    io::stdout().flush().unwrap();
    io::stdin().read_line(&mut input).unwrap();
}
